examples/tobias_tutorial/sneezing_simulation/templates/constant/cloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.org                      |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      cloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type        cloud;

solution
{
    coupled         false;
    transient       true;
    maxCo           0.8;
    cellValueSourceCorrection off;

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        mu              cell;
        //alpha           cell;
    }

    integrationSchemes
    {
        U               Euler;
    }

    sourceTerms
    {
        schemes
        {
            U semiImplicit 1;
        }
    }
}

constantProperties
{
    rho0            1069;
}

subModels
{
    particleForces
    {
        sphereDrag;
        gravity;
    }

    injectionModels
    {
        model1
        {
            type            patchInjection;
            patchName       mouth_1;
            U0              (0 0 0);

            parcelBasisType fixed;
            duration        0.20;

            SOI             0;
            parcelsPerSecond 25000;
            flowRateProfile constant 1;
            
            uniformParcelSize nParticle;
            nParticle 1;

            sizeDistribution
            {
                type        tabulatedDensity;
                Q           0;
                distribution 
                ( 
                    (1E-05	1.01E-11)
                    (2E-05	1.15E-05)
                    (3E-05	4.07E-03)
                    (4E-05	9.41E-02)
                    (5E-05	5.99E-01)
                    (6E-05	1.86E+00)
                    (7E-05	3.71E+00)
                    (8E-05	5.54E+00)
                    (9E-05	6.79E+00)
                    (0.0001	7.21E+00)
                    (0.00011	6.90E+00)
                    (0.00012	6.11E+00)
                    (0.00013	5.10E+00)
                    (0.00014	4.07E+00)
                    (0.00015	3.13E+00)
                    (0.00016	2.35E+00)
                    (0.00017	1.72E+00)
                    (0.00018	1.24E+00)
                    (0.00019	8.84E-01)
                    (0.0002	6.23E-01)
                    (0.00021	4.70E-01)
                    (0.00022	6.56E-01)
                    (0.00023	8.88E-01)
                    (0.00024	1.17E+00)
                    (0.00025	1.50E+00)
                    (0.00026	1.88E+00)
                    (0.00027	2.30E+00)
                    (0.00028	2.77E+00)
                    (0.00029	3.28E+00)
                    (0.0003	3.82E+00)
                    (0.00031	4.39E+00)
                    (0.00032	4.97E+00)
                    (0.00033	5.57E+00)
                    (0.00034	6.17E+00)
                    (0.00035	6.77E+00)
                    (0.00036	7.35E+00)
                    (0.00037	7.92E+00)
                    (0.00038	8.45E+00)
                    (0.00039	8.96E+00)
                    (0.0004	9.44E+00)
                    (0.00041	9.87E+00)
                    (0.00042	1.03E+01)
                    (0.00043	1.06E+01)
                    (0.00044	1.09E+01)
                    (0.00045	1.12E+01)
                    (0.00046	1.14E+01)
                    (0.00047	1.15E+01)
                    (0.00048	1.16E+01)
                    (0.00049	1.17E+01)
                    (0.0005	1.17E+01)
                    (0.00051	1.17E+01)
                    (0.00052	1.17E+01)
                    (0.00053	1.16E+01)
                    (0.00054	1.15E+01)
                    (0.00055	1.13E+01)
                    (0.00056	1.11E+01)
                    (0.00057	1.10E+01)
                    (0.00058	1.07E+01)
                    (0.00059	1.05E+01)
                    (0.0006	1.02E+01)
                    (0.00061	9.98E+00)
                    (0.00062	9.70E+00)
                    (0.00063	9.42E+00)
                    (0.00064	9.13E+00)
                    (0.00065	8.83E+00)
                    (0.00066	8.53E+00)
                    (0.00067	8.23E+00)
                    (0.00068	7.93E+00)
                    (0.00069	7.63E+00)
                    (0.0007	7.33E+00)
                    (0.00071	7.04E+00)
                    (0.00072	6.75E+00)
                    (0.00073	6.46E+00)
                    (0.00074	6.19E+00)
                    (0.00075	5.91E+00)
                    (0.00076	5.65E+00)
                    (0.00077	5.39E+00)
                    (0.00078	5.14E+00)
                    (0.00079	4.90E+00)
                    (0.0008	4.66E+00)
                    (0.00081	4.44E+00)
                    (0.00082	4.22E+00)
                    (0.00083	4.01E+00)
                    (0.00084	3.80E+00)
                    (0.00085	3.61E+00)
                    (0.00086	3.42E+00)
                    (0.00087	3.25E+00)
                    (0.00088	3.08E+00)
                    (0.00089	2.91E+00)
                    (0.0009	2.76E+00)
                    (0.00091	2.61E+00)
                    (0.00092	2.47E+00)
                    (0.00093	2.33E+00)
                    (0.00094	2.21E+00)
                    (0.00095	2.08E+00)
                    (0.00096	1.97E+00)
                    (0.00097	1.86E+00)
                    (0.00098	1.75E+00)
                    (0.00099	1.65E+00)
                    (0.001	1.56E+00)
                );
            }
        }

        model2
        {
            type            patchInjection;
            patchName       mouth_2;
            U0              (0 0 0);

            parcelBasisType fixed;
            duration        0.2;

            SOI             1;
            parcelsPerSecond 40000;
            flowRateProfile constant 1;
            
            uniformParcelSize nParticle;
            nParticle 1;

            sizeDistribution
            {
                type        tabulatedDensity;
                Q           0;
                distribution 
                (
                    (1E-05	1.01E-11)
                    (2E-05	1.15E-05)
                    (3E-05	4.07E-03)
                    (4E-05	9.41E-02)
                    (5E-05	5.99E-01)
                    (6E-05	1.86E+00)
                    (7E-05	3.71E+00)
                    (8E-05	5.54E+00)
                    (9E-05	6.79E+00)
                    (0.0001	7.21E+00)
                    (0.00011	6.90E+00)
                    (0.00012	6.11E+00)
                    (0.00013	5.10E+00)
                    (0.00014	4.07E+00)
                    (0.00015	3.13E+00)
                    (0.00016	2.35E+00)
                    (0.00017	1.72E+00)
                    (0.00018	1.24E+00)
                    (0.00019	8.84E-01)
                    (0.0002	6.23E-01)
                    (0.00021	4.70E-01)
                    (0.00022	6.56E-01)
                    (0.00023	8.88E-01)
                    (0.00024	1.17E+00)
                    (0.00025	1.50E+00)
                    (0.00026	1.88E+00)
                    (0.00027	2.30E+00)
                    (0.00028	2.77E+00)
                    (0.00029	3.28E+00)
                    (0.0003	3.82E+00)
                    (0.00031	4.39E+00)
                    (0.00032	4.97E+00)
                    (0.00033	5.57E+00)
                    (0.00034	6.17E+00)
                    (0.00035	6.77E+00)
                    (0.00036	7.35E+00)
                    (0.00037	7.92E+00)
                    (0.00038	8.45E+00)
                    (0.00039	8.96E+00)
                    (0.0004	9.44E+00)
                    (0.00041	9.87E+00)
                    (0.00042	1.03E+01)
                    (0.00043	1.06E+01)
                    (0.00044	1.09E+01)
                    (0.00045	1.12E+01)
                    (0.00046	1.14E+01)
                    (0.00047	1.15E+01)
                    (0.00048	1.16E+01)
                    (0.00049	1.17E+01)
                    (0.0005	1.17E+01)
                    (0.00051	1.17E+01)
                    (0.00052	1.17E+01)
                    (0.00053	1.16E+01)
                    (0.00054	1.15E+01)
                    (0.00055	1.13E+01)
                    (0.00056	1.11E+01)
                    (0.00057	1.10E+01)
                    (0.00058	1.07E+01)
                    (0.00059	1.05E+01)
                    (0.0006	1.02E+01)
                    (0.00061	9.98E+00)
                    (0.00062	9.70E+00)
                    (0.00063	9.42E+00)
                    (0.00064	9.13E+00)
                    (0.00065	8.83E+00)
                    (0.00066	8.53E+00)
                    (0.00067	8.23E+00)
                    (0.00068	7.93E+00)
                    (0.00069	7.63E+00)
                    (0.0007	7.33E+00)
                    (0.00071	7.04E+00)
                    (0.00072	6.75E+00)
                    (0.00073	6.46E+00)
                    (0.00074	6.19E+00)
                    (0.00075	5.91E+00)
                    (0.00076	5.65E+00)
                    (0.00077	5.39E+00)
                    (0.00078	5.14E+00)
                    (0.00079	4.90E+00)
                    (0.0008	4.66E+00)
                    (0.00081	4.44E+00)
                    (0.00082	4.22E+00)
                    (0.00083	4.01E+00)
                    (0.00084	3.80E+00)
                    (0.00085	3.61E+00)
                    (0.00086	3.42E+00)
                    (0.00087	3.25E+00)
                    (0.00088	3.08E+00)
                    (0.00089	2.91E+00)
                    (0.0009	2.76E+00)
                    (0.00091	2.61E+00)
                    (0.00092	2.47E+00)
                    (0.00093	2.33E+00)
                    (0.00094	2.21E+00)
                    (0.00095	2.08E+00)
                    (0.00096	1.97E+00)
                    (0.00097	1.86E+00)
                    (0.00098	1.75E+00)
                    (0.00099	1.65E+00)
                    (0.001	1.56E+00)
                );
            }
        }
    }

    dispersionModel none;

    patchInteractionModel localInteraction;

    localInteractionCoeffs
    {
        patches
        (
            "bodies|mouth_1|mouth_2|ground"
            {
                type stick;
                e    0.01;
                mu   0.;
            }
            "top|side"
            {
                type escape;
            }
        );
    }

    heatTransferModel none;

    surfaceFilmModel none;

    packingModel none;

    isotropyModel none;

    stochasticCollisionModel none;

    radiation off;

    dampingModel none;
}


cloudFunctions
{}


// ************************************************************************* //
